import {LocalizedStrings} from "../types.ts";

export const ru: LocalizedStrings = {
    header: {
        signUp: "Записаться на консультацию",
        menu: {
            about: "Алексей Кудрявцев",
            skills: "Навыки и образование",
            pricing: "Цены",
            articles: "Статьи и выступления"
        }
    },
    footer: {
        contact: {
            label: "Написать мне",
            name: "Telegram",
        },
        channel: {
            label: "Telegram канал",
            name: "Workin' me softly",
        }
    },
    aboutPage: {
        name: "Алексей Кудрявцев",
        job: "КПТ коуч для IT специалистов",
        aboutTitle: "Обо мне",
        aboutDescription: "Привет, я Алексей Кудрявцев. В IT с 2014, в менеджменте с 2019, в консалтинге с 2021. Сейчас я Engineering Manager команды CI/CD мобильных приложений в inDrive.\n\n За моими плечами: сильный технический бекграунд, опыт работы в Авито и inDrive, руководство конференциями Mobius и Podlodka Crew, проекты по перестройке инженерной культуры в крупных компаниях.\n\nМой багаж опыта помогает инженерам и тимлидам справляться со стрессом, профессиональными вызовами и выстраивать устойчивые рабочие подходы для долгосрочного результата. Я помогаю тем, кто хочет достигать своих целей в работе и карьере, опираясь на проверенные и эффективные методы, а не карго-культы.",
        facts: [
            {title: "500+", description: "Часов обучения менеджменту и коучингу"},
            {title: "250+", description: "Часов личной психотерапии"},
            {title: "150+", description: "Часов консультаций клиентов"},
            {title: "10+", description: "Лет в сфере IT"},
        ],
        requestsTitle: "С чем работаю",
        problem: "Проблема",
        resolution: "Решение",
        requests: [
            {
                problem: "Неопределенность или тупик на карьерном пути. Непонятно куда, как и зачем развиваться",
                resolution: "Построим рабочий план развития исходя их твоих целей и ценностей"
            },
            {
                problem: "Неуверенность в своей профессиональности, синдром самозванца, синдром отличника, выгорание",
                resolution: "Будем работать с деструктивными паттернами без осуждения"
            },
            {
                problem: "Ты стал тимлидом, но все горит и валится из рук",
                resolution: "Разберемся что значит быть лидером, что нужно от тебя в компании и как туда придти кратчайшим путем"
            },
            {
                problem: "Ищешь работу, но знаешь, что можешь получить оффер лучше",
                resolution: "Отполируем твое резюме, подтюним скиллы и научимся подавать себя на собеседованиях"
            },
            {
                problem: "Не идет какой-то проект, задача, много фрустрации",
                resolution: "Разберем по полочкам текущие проблемы, найдем мотивацию и построим план реализации"
            },
            {
                problem: "Команда показывает недостаточный или нестабильный результат, не попадает в коммитменты",
                resolution: "Помогу найти проблемные места и выстроить процессы для их нивелирования"
            },
            {
                problem: "Низкая инженерная культура, качество продукта и кода, все ломается",
                resolution: "Помогу выстроить культуру, внедрить практики Code review, тестирования, Extreme Programming, DevOps"
            },
        ],
    }
};
